print('--------------------------------------------------')
print('FitLife Console Bot')
print('V.0.0001')
print('02.10.2026')
print('Generalov A. Aleksandr')
print('(Misticle)')
print('--------------------------------------------------')
print()
print('--------------------------------------------------')
print('program - START')
print('--------------------------------------------------')
print()

#-----------------------------------
#отладка, удалить после!
#-----------------------------------
#cd '/home/alex/Projects/' && python3 '/home/alex/Projects/python_script_01.py'
#-----------------------------------

#-----------------------------------
#Задача (этап - 1):
#-----------------------------------

#Напишите код, который приветствует пользователя,
#спрашивает имя и возраст, и сохраняет эти данные в переменные
#с понятными именами (user_name, user_age).

#user_name = none
#user_age = none #change to integer after input

#Почему возраст нужно преобразовать в число (int)?
#Потому что в следующих шагах мы, возможно, будем использовать его для расчётов
#(например, корректировки нормы воды). Если оставить строку, программа упадёт.

#code:
#-----------------------------------
print('Приветствую тебя, мой маленький толстожопый друг!') #2) вежливо здоровается
user_name = input('Как тебя зовут? Напиши свое имя:') #3.1) запрашивает имя
user_age = int(input('О! мощно! А сколько тебе лет? укажи:')) #3.2) запрашивает возраст
if user_age <= 20:
    print('Молодой еще совсем! Значит эенергии еще хоть отбавляй!')
elif user_age > 20 and user_age <= 40:
    print('В самом расцвете сил, значит?')
else:
    print('Солидный возраст, как я вижу')
#-----------------------------------
#отладка, удалить после!
#-----------------------------------
print('-----------------------------------')
print('отладка:')
print('-----------------------------------')
print('user_name, user_age:')
print(user_name, user_age)
print('data type:')
print(type(user_name), type(user_age))
#-----------------------------------
